ci4final/app/Controllers/StudentsController.php

SELECT *
FROM `tbl_students`
---
    public function index()
    {
        $fetchStudent = new StudentsModel();
        $data['students'] = $fetchStudent->findAll();

INSERT INTO `tbl_students` (`student_name`, `student_id`, `student_section`, `student_course`, `student_batch`, `student_grade_level`) VALUES ('adsfasdasdf', '11111', '33', 'fsdaas', '2020asdfasd', '3rd Yearsdfa')
---
    public function storeStudent()
    {
        $insertStudents = new StudentsModel();
        //store the student

        $data = array(
            'student_name' => $this->request->getPost('studentName'),
            'student_id' => $this->request->getPost('studentNum'),
            'student_section' => $this->request->getPost('studentSection'),
            'student_course' => $this->request->getPost('studentCourse'),
            'student_batch' => $this->request->getPost('studentBatch'),
            'student_grade_level' => $this->request->getPost('studentLevel'),
        );

        $insertStudents->insert($data);

SELECT *
FROM `tbl_students`
WHERE `id` = '16'
 LIMIT 1
---
    public function editStudent($id)
    {
        $fetchStudent = new StudentsModel();
        $data['student'] = $fetchStudent->where('id', $id)->first();

DELETE FROM `tbl_students`
WHERE `id` IN ('20')
---
    public function deleteStudent($id)
    {
        $deleteStudent = new StudentsModel();
        $deleteStudent ->delete($id);